Masmiseim36/nxpSDK/boards/frdmimxrt1186/demo_apps/mc_pmsm/pmsm_servo/cm7/pin_mux.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMXRT1186xxxxx
package_id: MIMXRT1186CVJ8C
mcu_data: ksdk2_0
processor_version: 25.09.0
pin_labels:
- {pin_num: B8, pin_signal: GPIO_AON_15, label: ETH0, identifier: ETH0;ETH0_RESET}
- {pin_num: A3, pin_signal: GPIO_AON_20, label: ETH2, identifier: ETH2;ETH2_RESET}
- {pin_num: F5, pin_signal: GPIO_EMC_B1_01, label: M1_ENDAT_DIR_ENC_B, identifier: pin;flexio_pin;ENC_B;M1_ENDAT_DIR_ENC_B}
- {pin_num: M14, pin_signal: GPIO_AD_29, label: CUR_C, identifier: FLEXIO_SPI;CUR_C}
- {pin_num: D8, pin_signal: GPIO_AON_03, label: ETH0, identifier: ETH0_INT_B}
- {pin_num: E7, pin_signal: GPIO_AON_04, label: ETH2, identifier: ETH2_INT_B}
- {pin_num: M13, pin_signal: GPIO_AD_12, label: CUR_A, identifier: CUR_A}
- {pin_num: M12, pin_signal: GPIO_AD_13, label: CUR_B, identifier: CUR_B}
- {pin_num: M11, pin_signal: GPIO_AD_14, label: VOLT_DCB, identifier: VOLT_DCB}
- {pin_num: E5, pin_signal: GPIO_EMC_B1_12, label: PWM_AT, identifier: PWM_AT}
- {pin_num: E3, pin_signal: GPIO_EMC_B1_13, label: PWM_AB, identifier: PWM_AB}
- {pin_num: F4, pin_signal: GPIO_EMC_B1_14, label: PWM_BT, identifier: PWM_BT}
- {pin_num: D1, pin_signal: GPIO_EMC_B1_15, label: PWM_BB, identifier: PWM_BB}
- {pin_num: B1, pin_signal: GPIO_EMC_B1_17, label: PWM_CT, identifier: PWM_CT}
- {pin_num: E2, pin_signal: GPIO_EMC_B1_16, label: PWM_CB, identifier: PWM_CB}
- {pin_num: D3, pin_signal: GPIO_EMC_B1_11, label: LED_GREEN_CTL, identifier: LED_GREEN_CTL}
- {pin_num: G3, pin_signal: GPIO_EMC_B1_00, label: M1_ENDATA_DATA_IN_ENC_A, identifier: ENC_A;ENCODER_00;M1_ENDATA_DATA_IN_ENC_A}
- {pin_num: E10, pin_signal: GPIO_SD_B1_03, label: OC_FAULT, identifier: OV_FAULT;OC_FAULT}
- {pin_num: K1, pin_signal: GPIO_EMC_B1_39, label: OV_FAULT, identifier: OC_FAULT;OV_FAULT}
- {pin_num: B2, pin_signal: GPIO_EMC_B1_18, label: J53_14, identifier: J53_14;J53_12}
- {pin_num: E4, pin_signal: GPIO_EMC_B1_19, label: J53_14, identifier: J53_14}
- {pin_num: E6, pin_signal: GPIO_EMC_B1_03, label: M1_ENDAT_DATA_OUT_ENC_HOME, identifier: M1_ENDAT_DATA_OUT_ENC_HOME}
- {pin_num: G2, pin_signal: GPIO_EMC_B1_02, label: M1_ENDAT_CLK_ENC_I, identifier: M1_ENDAT_CLK_ENC_I}
- {pin_num: J6, pin_signal: GPIO_EMC_B1_25, label: M2_ENDAT_DATA_OUT_ENC_HOME_FlexIO1, identifier: M2_ENDAT_DATA_OUT_ENC_HOME;M2_ENDAT_DATA_OUT_ENC_HOME_FlexIO1}
- {pin_num: J3, pin_signal: GPIO_EMC_B1_24, label: M2_ENDAT_CLK_ENC_I_FlexIO1, identifier: M2_ENDAT_CLK_ENC_I;M2_ENDAT_CLK_ENC_I_FlexIO1}
- {pin_num: E1, pin_signal: GPIO_EMC_B1_05, label: M2_ENDAT_DIR_ENC_B_FlexIO1, identifier: M2_ENDAT_DIR_ENC_B;M2_ENDAT_DIR_ENC_B_FlexIO1}
- {pin_num: H5, pin_signal: GPIO_EMC_B1_04, label: M2_ENDATA_DATA_IN_ENC_A_FlexIO1, identifier: M2_ENDATA_DATA_IN_ENC_A;M2_ENDATA_DATA_IN_ENC_A_FlexIO1}
- {pin_num: B5, pin_signal: GPIO_AON_18, label: TP_J3_16, identifier: TP_J3_16}
- {pin_num: A4, pin_signal: GPIO_AON_19, label: TP_J3_18, identifier: TP_J3_18}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbar.h"
#include "fsl_iomuxc.h"
#include "fsl_rgpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitPWM();
    BOARD_InitLPUART();
    BOARD_InitENC();
    BOARD_InitSINC();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: D3, peripheral: RGPIO2, signal: 'gpio_io, 11', pin_signal: GPIO_EMC_B1_11, direction: OUTPUT}
  - {pin_num: B5, peripheral: RGPIO1, signal: 'gpio_io, 18', pin_signal: GPIO_AON_18}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of LED_GREEN_CTL on GPIO_EMC_B1_11 (pin D3) */
  rgpio_pin_config_t LED_GREEN_CTL_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_11 (pin D3) */
  RGPIO_PinInit(RGPIO2, 11U, &LED_GREEN_CTL_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_11_GPIO2_IO11,       /* GPIO_EMC_B1_11 is configured as GPIO2_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_18_GPIO1_IO18,          /* GPIO_AON_18 is configured as GPIO1_IO18 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


