Masmiseim36/nxpSDK/boards/frdmimxrt1186/demo_apps/mc_pmsm/pmsm_servo/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLPUART:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: B12, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AON_09}
  - {pin_num: A7, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AON_08}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPUART, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPUART(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 is configured as LPUART1_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 is configured as LPUART1_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENC:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: G3, peripheral: FLEXIO1, signal: 'IO, 00', pin_signal: GPIO_EMC_B1_00, identifier: M1_ENDATA_DATA_IN_ENC_A}
  - {pin_num: F5, peripheral: FLEXIO1, signal: 'IO, 01', pin_signal: GPIO_EMC_B1_01, identifier: M1_ENDAT_DIR_ENC_B}
  - {pin_num: E6, peripheral: FLEXIO1, signal: 'IO, 03', pin_signal: GPIO_EMC_B1_03}
  - {pin_num: G2, peripheral: FLEXIO1, signal: 'IO, 02', pin_signal: GPIO_EMC_B1_02}
  - {peripheral: TRIGGER_SYNC, signal: 'SYNC_IN, 0', pin_signal: FLEXPWM4_PWM0_OUT_TRIG0_1}
  - {peripheral: FLEXIO1, signal: 'TRIG_IN, 0', pin_signal: TRIGGER_SYNC_OUT0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitENC, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitENC(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_00_FLEXIO1_FLEXIO00,  /* GPIO_EMC_B1_00 is configured as FLEXIO1_FLEXIO00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_01_FLEXIO1_FLEXIO01,  /* GPIO_EMC_B1_01 is configured as FLEXIO1_FLEXIO01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_02_FLEXIO1_FLEXIO02,  /* GPIO_EMC_B1_02 is configured as FLEXIO1_FLEXIO02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_03_FLEXIO1_FLEXIO03,  /* GPIO_EMC_B1_03 is configured as FLEXIO1_FLEXIO03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm4Pwm0OutTrig01, kXBAR1_OutputTriggerSyncIn0); /* FLEXPWM4_PWM0_OUT_TRIG0_1 output assigned to XBAR1_IN90 input is connected to XBAR1_OUT30 output assigned to TRIGGER_SYNC_IN0 */
  XBAR_SetSignalsConnection(kXBAR1_InputTriggerSyncOut0, kXBAR1_OutputFlexio1TrigIn0); /* TRIGGER_SYNC_OUT0 output assigned to XBAR1_IN106 input is connected to XBAR1_OUT152 output assigned to FLEXIO1_TRIG_IN0 */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSINC:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: C2, peripheral: SINC3, signal: 'EMBIT, 3', pin_signal: GPIO_EMC_B1_10}
  - {pin_num: F3, peripheral: SINC3, signal: 'EMBIT, 2', pin_signal: GPIO_EMC_B1_08}
  - {pin_num: H4, peripheral: SINC3, signal: 'EMBIT, 1', pin_signal: GPIO_EMC_B1_06}
  - {pin_num: H5, peripheral: SINC3, signal: 'EMBIT, 0', pin_signal: GPIO_EMC_B1_04}
  - {pin_num: C11, peripheral: SINC3, signal: 'MOD_CLK, 1', pin_signal: GPIO_B2_05}
  - {peripheral: SINC3, signal: 'EXT_TRIG, 0', pin_signal: FLEXPWM4_PWM0_OUT_TRIG0_1}
  - {pin_num: E9, peripheral: SINC3, signal: 'MOD_CLK, 0', pin_signal: GPIO_B2_04}
  - {pin_num: E8, peripheral: SINC3, signal: 'MOD_CLK, 2', pin_signal: GPIO_B2_06}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSINC, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSINC(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_04_SINC3_MOD_CLK0,       /* GPIO_B2_04 is configured as SINC3_MOD_CLK0 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_05_SINC3_MOD_CLK1,       /* GPIO_B2_05 is configured as SINC3_MOD_CLK1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_06_SINC3_MOD_CLK2,       /* GPIO_B2_06 is configured as SINC3_MOD_CLK2 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_04_SINC3_EMBIT00,    /* GPIO_EMC_B1_04 is configured as SINC3_EMBIT00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_06_SINC3_EMBIT01,    /* GPIO_EMC_B1_06 is configured as SINC3_EMBIT01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_08_SINC3_EMBIT02,    /* GPIO_EMC_B1_08 is configured as SINC3_EMBIT02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_10_SINC3_EMBIT03,    /* GPIO_EMC_B1_10 is configured as SINC3_EMBIT03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm4Pwm0OutTrig01, kXBAR1_OutputSinc123ExtTrig0); /* FLEXPWM4_PWM0_OUT_TRIG0_1 output assigned to XBAR1_IN90 input is connected to XBAR1_OUT148 output assigned to SINC1_2_3_EXT_TRIG0 */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
